In [86]:
import pandas as pd

## Data Transformation Functions in Pandas(Feature Engineering)
1. Apply()
2. Map()
3. Assign()
4. Replace(old, new)

In [87]:
df = pd.read_csv("raw_data.csv")

In [88]:
print(df)

    id          name   age country   gender    income
0    1      John Doe  29.0     USA     Male   55000.0
1    1      John Doe  29.0     USA     Male   55000.0
2    2    Jane Smith   NaN  Canada   Female   62000.0
3    3          Alex   NaN     USA  Unknown   47000.0
4    4  Maria Garcia  34.0   Spain   Female       NaN
5    5        Li Wei  27.0   China     Male   51000.0
6    6           NaN  45.0   India   Female  730000.0
7    7    Ahmed Khan  38.0     NaN     Male   68000.0
8    8    Rachel Lee  29.0     USA   Female   62000.0
9    9   Carols Ruiz   NaN  Mexico     Male   45000.0
10  10   Emily Davis  31.0     USA   Female   58000.0

In [89]:
#Feature Engineering
df2 = df.copy()

In [90]:
df2["tax"] = df2["income"].apply(lambda x: "20%" if x>=50000 else "10%")

In [91]:
df2

    id          name   age country   gender    income  tax
0    1      John Doe  29.0     USA     Male   55000.0  20%
1    1      John Doe  29.0     USA     Male   55000.0  20%
2    2    Jane Smith   NaN  Canada   Female   62000.0  20%
3    3          Alex   NaN     USA  Unknown   47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female       NaN  10%
5    5        Li Wei  27.0   China     Male   51000.0  20%
6    6           NaN  45.0   India   Female  730000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male   68000.0  20%
8    8    Rachel Lee  29.0     USA   Female   62000.0  20%
9    9   Carols Ruiz   NaN  Mexico     Male   45000.0  10%
10  10   Emily Davis  31.0     USA   Female   58000.0  20%

In [92]:
#Let's convert Male = > M, Female => F, Unknown => U
gender_map = {"Male":"M", "Female":"F", "Unknown":"U"}
df2["gender"] = df2["gender"].map(gender_map)

In [93]:
df2

    id          name   age country gender    income  tax
0    1      John Doe  29.0     USA      M   55000.0  20%
1    1      John Doe  29.0     USA      M   55000.0  20%
2    2    Jane Smith   NaN  Canada      F   62000.0  20%
3    3          Alex   NaN     USA      U   47000.0  10%
4    4  Maria Garcia  34.0   Spain      F       NaN  10%
5    5        Li Wei  27.0   China      M   51000.0  20%
6    6           NaN  45.0   India      F  730000.0  20%
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%
8    8    Rachel Lee  29.0     USA      F   62000.0  20%
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%
10  10   Emily Davis  31.0     USA      F   58000.0  20%

In [94]:
#Let's increase the income of everyone by 10X

df2 = df2.assign(new_income=df2["income"]*1.1)

In [95]:
df2["country"] = df2["country"].replace("USA", "US")

In [96]:
df2

    id          name   age country gender    income  tax  new_income
0    1      John Doe  29.0      US      M   55000.0  20%     60500.0
1    1      John Doe  29.0      US      M   55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F   62000.0  20%     68200.0
3    3          Alex   NaN      US      U   47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F       NaN  10%         NaN
5    5        Li Wei  27.0   China      M   51000.0  20%     56100.0
6    6           NaN  45.0   India      F  730000.0  20%    803000.0
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US      F   62000.0  20%     68200.0
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%     49500.0
10  10   Emily Davis  31.0      US      F   58000.0  20%     63800.0

In [97]:
df.columns
df2.columns = ["Id", "Name", "Age", "Country", "Gender", "Income", "Tax", "New_Income"]

In [98]:
df2

    Id          Name   Age Country Gender    Income  Tax  New_Income
0    1      John Doe  29.0      US      M   55000.0  20%     60500.0
1    1      John Doe  29.0      US      M   55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F   62000.0  20%     68200.0
3    3          Alex   NaN      US      U   47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F       NaN  10%         NaN
5    5        Li Wei  27.0   China      M   51000.0  20%     56100.0
6    6           NaN  45.0   India      F  730000.0  20%    803000.0
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US      F   62000.0  20%     68200.0
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%     49500.0
10  10   Emily Davis  31.0      US      F   58000.0  20%     63800.0

1. rename(columns={old:new})
2. sort_values()
3. sort_index()
4. reset_index()
5. rank()
6. reorder columns

## Renaming a perticular column

In [99]:
df2.rename(columns={"New_Income":"Revised Income"})

    Id          Name   Age Country Gender    Income  Tax  Revised Income
0    1      John Doe  29.0      US      M   55000.0  20%         60500.0
1    1      John Doe  29.0      US      M   55000.0  20%         60500.0
2    2    Jane Smith   NaN  Canada      F   62000.0  20%         68200.0
3    3          Alex   NaN      US      U   47000.0  10%         51700.0
4    4  Maria Garcia  34.0   Spain      F       NaN  10%             NaN
5    5        Li Wei  27.0   China      M   51000.0  20%         56100.0
6    6           NaN  45.0   India      F  730000.0  20%        803000.0
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%         74800.0
8    8    Rachel Lee  29.0      US      F   62000.0  20%         68200.0
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%         49500.0
10  10   Emily Davis  31.0      US      F   58000.0  20%         63800.0

In [100]:
df2.rename(index={1:"First"})

       Id          Name   Age Country Gender    Income  Tax  New_Income
0       1      John Doe  29.0      US      M   55000.0  20%     60500.0
First   1      John Doe  29.0      US      M   55000.0  20%     60500.0
2       2    Jane Smith   NaN  Canada      F   62000.0  20%     68200.0
3       3          Alex   NaN      US      U   47000.0  10%     51700.0
4       4  Maria Garcia  34.0   Spain      F       NaN  10%         NaN
5       5        Li Wei  27.0   China      M   51000.0  20%     56100.0
6       6           NaN  45.0   India      F  730000.0  20%    803000.0
7       7    Ahmed Khan  38.0     NaN      M   68000.0  20%     74800.0
8       8    Rachel Lee  29.0      US      F   62000.0  20%     68200.0
9       9   Carols Ruiz   NaN  Mexico      M   45000.0  10%     49500.0
10     10   Emily Davis  31.0      US      F   58000.0  20%     63800.0

## Sort the Dataframe based on Income values

In [103]:
df2.sort_values("Income")

    Id          Name   Age Country Gender    Income  Tax  New_Income
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%     49500.0
3    3          Alex   NaN      US      U   47000.0  10%     51700.0
5    5        Li Wei  27.0   China      M   51000.0  20%     56100.0
1    1      John Doe  29.0      US      M   55000.0  20%     60500.0
0    1      John Doe  29.0      US      M   55000.0  20%     60500.0
10  10   Emily Davis  31.0      US      F   58000.0  20%     63800.0
2    2    Jane Smith   NaN  Canada      F   62000.0  20%     68200.0
8    8    Rachel Lee  29.0      US      F   62000.0  20%     68200.0
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%     74800.0
6    6           NaN  45.0   India      F  730000.0  20%    803000.0
4    4  Maria Garcia  34.0   Spain      F       NaN  10%         NaN

In [102]:
df2

    Id          Name   Age Country Gender    Income  Tax  New_Income
0    1      John Doe  29.0      US      M   55000.0  20%     60500.0
1    1      John Doe  29.0      US      M   55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F   62000.0  20%     68200.0
3    3          Alex   NaN      US      U   47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F       NaN  10%         NaN
5    5        Li Wei  27.0   China      M   51000.0  20%     56100.0
6    6           NaN  45.0   India      F  730000.0  20%    803000.0
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US      F   62000.0  20%     68200.0
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%     49500.0
10  10   Emily Davis  31.0      US      F   58000.0  20%     63800.0

In [104]:
df2.sort_values("Income", ascending=False)

    Id          Name   Age Country Gender    Income  Tax  New_Income
6    6           NaN  45.0   India      F  730000.0  20%    803000.0
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US      F   62000.0  20%     68200.0
2    2    Jane Smith   NaN  Canada      F   62000.0  20%     68200.0
10  10   Emily Davis  31.0      US      F   58000.0  20%     63800.0
0    1      John Doe  29.0      US      M   55000.0  20%     60500.0
1    1      John Doe  29.0      US      M   55000.0  20%     60500.0
5    5        Li Wei  27.0   China      M   51000.0  20%     56100.0
3    3          Alex   NaN      US      U   47000.0  10%     51700.0
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%     49500.0
4    4  Maria Garcia  34.0   Spain      F       NaN  10%         NaN

In [109]:
df2 = df2.fillna(100)
sorted_df=df2.sort_values(["Income", "Age"])#If income is same, sorting will be according to age
sorted_df.sort_index()
sorted_df.reset_index()

    index  Id          Name    Age Country Gender    Income  Tax  New_Income
0       4   4  Maria Garcia   34.0   Spain      F     100.0  10%       100.0
1       9   9   Carols Ruiz  100.0  Mexico      M   45000.0  10%     49500.0
2       3   3          Alex  100.0      US      U   47000.0  10%     51700.0
3       5   5        Li Wei   27.0   China      M   51000.0  20%     56100.0
4       0   1      John Doe   29.0      US      M   55000.0  20%     60500.0
5       1   1      John Doe   29.0      US      M   55000.0  20%     60500.0
6      10  10   Emily Davis   31.0      US      F   58000.0  20%     63800.0
7       8   8    Rachel Lee   29.0      US      F   62000.0  20%     68200.0
8       2   2    Jane Smith  100.0  Canada      F   62000.0  20%     68200.0
9       7   7    Ahmed Khan   38.0     100      M   68000.0  20%     74800.0
10      6   6           100   45.0   India      F  730000.0  20%    803000.0

In [113]:
#Ranking
sorted_df["Ranking"] = sorted_df["Income"].rank(ascending=False, method="max")

In [111]:
sorted_df

    Id          Name    Age Country Gender    Income  Tax  New_Income  Ranking
4    4  Maria Garcia   34.0   Spain      F     100.0  10%       100.0     11.0
9    9   Carols Ruiz  100.0  Mexico      M   45000.0  10%     49500.0     10.0
3    3          Alex  100.0      US      U   47000.0  10%     51700.0      9.0
5    5        Li Wei   27.0   China      M   51000.0  20%     56100.0      8.0
0    1      John Doe   29.0      US      M   55000.0  20%     60500.0      6.5
1    1      John Doe   29.0      US      M   55000.0  20%     60500.0      6.5
10  10   Emily Davis   31.0      US      F   58000.0  20%     63800.0      5.0
8    8    Rachel Lee   29.0      US      F   62000.0  20%     68200.0      3.5
2    2    Jane Smith  100.0  Canada      F   62000.0  20%     68200.0      3.5
7    7    Ahmed Khan   38.0     100      M   68000.0  20%     74800.0      2.0
6    6           100   45.0   India      F  730000.0  20%    803000.0      1.0

In [114]:
sorted_df.columns

Index(['Id', 'Name', 'Age', 'Country', 'Gender', 'Income', 'Tax', 'New_Income',
       'Ranking'],
      dtype='object')

In [115]:
#Reorder columns
sorted_df[['Id', 'Name', 'Age', 'Country', 'Gender', 'Income', 'New_Income','Ranking', 'Tax']]

    Id          Name    Age Country Gender    Income  New_Income  Ranking  Tax
4    4  Maria Garcia   34.0   Spain      F     100.0       100.0     11.0  10%
9    9   Carols Ruiz  100.0  Mexico      M   45000.0     49500.0     10.0  10%
3    3          Alex  100.0      US      U   47000.0     51700.0      9.0  10%
5    5        Li Wei   27.0   China      M   51000.0     56100.0      8.0  20%
0    1      John Doe   29.0      US      M   55000.0     60500.0      7.0  20%
1    1      John Doe   29.0      US      M   55000.0     60500.0      7.0  20%
10  10   Emily Davis   31.0      US      F   58000.0     63800.0      5.0  20%
8    8    Rachel Lee   29.0      US      F   62000.0     68200.0      4.0  20%
2    2    Jane Smith  100.0  Canada      F   62000.0     68200.0      4.0  20%
7    7    Ahmed Khan   38.0     100      M   68000.0     74800.0      2.0  20%
6    6           100   45.0   India      F  730000.0    803000.0      1.0  20%